#include <stdio.h>
#include <string.h>
//////////////////////////////////////////////////////////////////////////
#define __DE__
//////////////////////////////////////////////////////////////////////////
/*                          |7|6|5|4|3|2|1|0|                           */
//////////////////////////////////////////////////////////////////////////
#ifdef __EN__
int main()
{
    char passwd[] = "这里是长10位的密码";
//分析明文与密文长度和加密代码可知明文密码的每位加密后将生成2+2位16进制密文，将这4位分为加密段1(2位16进制)和加密段2(2位16进制)
    char key[] = "helloworld";
    char part1[11];
    char part2[11];
    for (int i = 0; i < strlen(passwd); i++)
    {
        part1[i] = (passwd[i] & 0x55) | (key[i] & 0xaa);
//将二进制passwd[i]的4个偶数位与二进制key[i]的4个奇数位合为一个8位二进制存储在part1[i]中
        part2[i] = (passwd[i] & 0xaa) | (key[i] & 0x55);
//将二进制passwd[i]的4个奇数位与二进制key[i]的4个偶数位合为一个8位二进制存储在part2[i]中
        printf("%02x", ((part2[i] & 0xf) << 4) | (part1[i] & 0xf));
//将part1[i]的低位作为加密段1的低位，part2[i]的低位作为加密段1的高位，然后输出加密段1
        printf("%02x", (part2[i] & 0xf0) | ((part1[i] & 0xf0) >> 4));
//将part1[i]的高位作为加密段2的低位，part2[i]的高位作为加密段2的高位，然后输出加密段2
    }
}
#endif
//////////////////////////////////////////////////////////////////////////
/*           OUTPUT: 896750634d67e847da665373db6707774c63e466           */
//////////////////////////////////////////////////////////////////////////
#ifdef __DE__

#define BIN_01010101 0x55
#define BIN_10101010 0xaa
#define BIN_00001111 0xf
#define BIN_11110000 0xf0
#define LENGTH 10
int main(void)
{
    unsigned char block[2] = {0}, part1 = 0, part2 = 0, passwd = 0;
    int i = 0;
    for (i = 0; i < LENGTH; i++)
    {
        scanf("%2x %2x", &block[0], &block[1]);
//读取加密段1和加密段2并保存在char型数组block中
        part1 = (block[0] & BIN_00001111) | ((block[1] & BIN_00001111) << 4);
//将加密段1的低位和加密段2的低位还原为part1的低位和高位
        part2 = ((block[0] & BIN_11110000) >> 4) | (block[1] & BIN_11110000);
//将加密段1的高位和加密段2的高位还原为part2的低位和高位
        passwd = (part1 & BIN_01010101) | (part2 & BIN_10101010);
//取二进制part1的4个偶数位和二进制part2的4个奇数位合为8位二进制的明文
        printf("%c", passwd);
//输出一位明文
    }
}

#endif
//////////////////////////////////////////////////////////////////////////
/*                          passwd{y0uZh1yu4n}                          */
//////////////////////////////////////////////////////////////////////////